In [39]:
import pandas as pd
import numpy as np

#Removing null values in dataset

In [40]:
df= pd.read_csv(r"C:/Users/harshit/Desktop/CarDekho/Car details v3.csv")

In [41]:
df.drop(['name'],axis=1, inplace=True)
df['seats'].fillna(df['seats'].median(),inplace=True)
df.drop(['torque'],axis=1,inplace=True)

df.shape

(8128, 11)

In [42]:
df.dropna(axis=0, how='any', inplace=True)
final_df=df

In [43]:
df.isnull().sum()
df.head()

,year,selling_price,km_driven,fuel,seller_type,transmission,owner,mileage,engine,max_power,seats
0,2014,450000,145500,Diesel,Individual,Manual,First Owner,23.4 kmpl,1248 CC,74 bhp,5.0
1,2014,370000,120000,Diesel,Individual,Manual,Second Owner,21.14 kmpl,1498 CC,103.52 bhp,5.0
2,2006,158000,140000,Petrol,Individual,Manual,Third Owner,17.7 kmpl,1497 CC,78 bhp,5.0
3,2010,225000,127000,Diesel,Individual,Manual,First Owner,23.0 kmpl,1396 CC,90 bhp,5.0
4,2007,130000,120000,Petrol,Individual,Manual,First Owner,16.1 kmpl,1298 CC,88.2 bhp,5.0

In [44]:
df.shape

(7907, 11)

In [45]:
#df.head()
df.tail()

,year,selling_price,km_driven,fuel,seller_type,transmission,owner,mileage,engine,max_power,seats
8123,2013,320000,110000,Petrol,Individual,Manual,First Owner,18.5 kmpl,1197 CC,82.85 bhp,5.0
8124,2007,135000,119000,Diesel,Individual,Manual,Fourth & Above Owner,16.8 kmpl,1493 CC,110 bhp,5.0
8125,2009,382000,120000,Diesel,Individual,Manual,First Owner,19.3 kmpl,1248 CC,73.9 bhp,5.0
8126,2013,290000,25000,Diesel,Individual,Manual,First Owner,23.57 kmpl,1396 CC,70 bhp,5.0
8127,2013,290000,25000,Diesel,Individual,Manual,First Owner,23.57 kmpl,1396 CC,70 bhp,5.0

In [46]:
import statistics
km_driven_mean=np.mean(df['km_driven'])
km_driven_svd=statistics.stdev(df['km_driven'])
print(km_driven_mean)
print(km_driven_svd)

# while i in df['km_driven']:
#     df.loc[i, "km_driven"]=(df.loc[i, "km_driven"]-km_driven_mean)/km_driven_svd

69192.55646895156
56789.76160208454

In [47]:
df.head()

,year,selling_price,km_driven,fuel,seller_type,transmission,owner,mileage,engine,max_power,seats
0,2014,450000,145500,Diesel,Individual,Manual,First Owner,23.4 kmpl,1248 CC,74 bhp,5.0
1,2014,370000,120000,Diesel,Individual,Manual,Second Owner,21.14 kmpl,1498 CC,103.52 bhp,5.0
2,2006,158000,140000,Petrol,Individual,Manual,Third Owner,17.7 kmpl,1497 CC,78 bhp,5.0
3,2010,225000,127000,Diesel,Individual,Manual,First Owner,23.0 kmpl,1396 CC,90 bhp,5.0
4,2007,130000,120000,Petrol,Individual,Manual,First Owner,16.1 kmpl,1298 CC,88.2 bhp,5.0

In [48]:
df['mileage'] = df['mileage'].map(lambda x: x.rstrip(' kmpl'))
df['mileage'] = df['mileage'].map(lambda x: x.rstrip(' km/kg'))

df['engine'] = df['engine'].map(lambda x: x.rstrip(' CC'))
df['max_power'] = df['max_power'].map(lambda x: x.rstrip(' bhp'))

In [49]:
df.isnull().sum()

year             0
selling_price    0
km_driven        0
fuel             0
seller_type      0
transmission     0
owner            0
mileage          0
engine           0
max_power        0
seats            0
dtype: int64

In [50]:

#df=pd.get_dummies(df,drop_first=True)

In [51]:

df['mileage'] = df['mileage'].map(lambda x: x.rstrip('  km/kg'))
df.head(10)
df.to_csv(r"C:/Users/harshit/Desktop/CarDekho/DataSet.csv")
df= pd.read_csv(r"C:/Users/harshit/Desktop/CarDekho/DataSet.csv")

In [55]:
final_df=df
df=pd.get_dummies(df,drop_first=True)

In [58]:
df.shape

(7907, 18)

In [59]:
df.head()

,Unnamed: 0,year,selling_price,km_driven,mileage,engine,max_power,seats,fuel_Diesel,fuel_LPG,fuel_Petrol,seller_type_Individual,seller_type_Trustmark Dealer,transmission_Manual,owner_Fourth & Above Owner,owner_Second Owner,owner_Test Drive Car,owner_Third Owner
0,0,2014,450000,145500,23.40,1248,74.00,5.0,1,0,0,1,0,1,0,0,0,0
1,1,2014,370000,120000,21.14,1498,103.52,5.0,1,0,0,1,0,1,0,1,0,0
2,2,2006,158000,140000,17.70,1497,78.00,5.0,0,0,1,1,0,1,0,0,0,1
3,3,2010,225000,127000,23.00,1396,90.00,5.0,1,0,0,1,0,1,0,0,0,0
4,4,2007,130000,120000,16.10,1298,88.20,5.0,0,0,1,1,0,1,0,0,0,0

In [74]:
df['current_year']=2020
#df['total_used_year']=df['current_year']-df['year']
#df.drop(['year'],axis=1,inplace=True)
df.drop(['current_year'],axis=1,inplace=True)

In [75]:
df.head()

,Unnamed: 0,selling_price,km_driven,mileage,engine,max_power,seats,fuel_Diesel,fuel_LPG,fuel_Petrol,seller_type_Individual,seller_type_Trustmark Dealer,transmission_Manual,owner_Fourth & Above Owner,owner_Second Owner,owner_Test Drive Car,owner_Third Owner,total_used_year
0,0,450000,145500,23.40,1248,74.00,5.0,1,0,0,1,0,1,0,0,0,0,6
1,1,370000,120000,21.14,1498,103.52,5.0,1,0,0,1,0,1,0,1,0,0,6
2,2,158000,140000,17.70,1497,78.00,5.0,0,0,1,1,0,1,0,0,0,1,14
3,3,225000,127000,23.00,1396,90.00,5.0,1,0,0,1,0,1,0,0,0,0,10
4,4,130000,120000,16.10,1298,88.20,5.0,0,0,1,1,0,1,0,0,0,0,13

In [76]:
df.head()

,Unnamed: 0,selling_price,km_driven,mileage,engine,max_power,seats,fuel_Diesel,fuel_LPG,fuel_Petrol,seller_type_Individual,seller_type_Trustmark Dealer,transmission_Manual,owner_Fourth & Above Owner,owner_Second Owner,owner_Test Drive Car,owner_Third Owner,total_used_year
0,0,450000,145500,23.40,1248,74.00,5.0,1,0,0,1,0,1,0,0,0,0,6
1,1,370000,120000,21.14,1498,103.52,5.0,1,0,0,1,0,1,0,1,0,0,6
2,2,158000,140000,17.70,1497,78.00,5.0,0,0,1,1,0,1,0,0,0,1,14
3,3,225000,127000,23.00,1396,90.00,5.0,1,0,0,1,0,1,0,0,0,0,10
4,4,130000,120000,16.10,1298,88.20,5.0,0,0,1,1,0,1,0,0,0,0,13

In [82]:
final_dataCol=df
final_dataCol.head()
x=final_dataCol.iloc[:,2:]
y=final_dataCol.iloc[:,1]

In [83]:
print(x)

      km_driven  mileage  engine  max_power  seats  fuel_Diesel  fuel_LPG  \
0        145500    23.40    1248      74.00    5.0            1         0
1        120000    21.14    1498     103.52    5.0            1         0
2        140000    17.70    1497      78.00    5.0            0         0
3        127000    23.00    1396      90.00    5.0            1         0
4        120000    16.10    1298      88.20    5.0            0         0
...         ...      ...     ...        ...    ...          ...       ...
7902     110000    18.50    1197      82.85    5.0            0         0
7903     119000    16.80    1493     110.00    5.0            1         0
7904     120000    19.30    1248      73.90    5.0            1         0
7905      25000    23.57    1396      70.00    5.0            1         0
7906      25000    23.57    1396      70.00    5.0            1         0

      fuel_Petrol  seller_type_Individual  seller_type_Trustmark Dealer  \
0               0                       1                             0
1               0                       1                             0
2               1                       1                             0
3               0                       1                             0
4               1                       1                             0
...           ...                     ...                           ...
7902            1                       1                             0
7903            0                       1                             0
7904            0                       1                             0
7905            0                       1                             0
7906            0                       1                             0

      transmission_Manual  owner_Fourth & Above Owner  owner_Second Owner  \
0                       1                           0                   0
1                       1                           0                   1
2                       1                           0                   0
3                       1                           0                   0
4                       1                           0                   0
...                   ...                         ...                 ...
7902                    1                           0                   0
7903                    1                           1                   0
7904                    1                           0                   0
7905                    1                           0                   0
7906                    1                           0                   0

      owner_Test Drive Car  owner_Third Owner  total_used_year
0                        0                  0                6
1                        0                  0                6
2                        0                  1               14
3                        0                  0               10
4                        0                  0               13
...                    ...                ...              ...
7902                     0                  0                7
7903                     0                  0               13
7904                     0                  0               11
7905                     0                  0                7
7906                     0                  0                7

[7907 rows x 16 columns]